{
    "Flu": {
        "description": "Infeksi virus yang menyerang hidung, tenggorokan, dan paru-paru. Flu mudah menular dan bisa menyebabkan demam, sakit tenggorokan, batuk, pilek, dan nyeri otot.",
        "recommendations": [
            "Istirahat yang cukup untuk memulihkan kondisi tubuh",
            "Minum air putih yang banyak untuk mencegah dehidrasi",
            "Konsumsi obat penurun demam seperti paracetamol jika diperlukan",
            "Hindari makanan atau minuman yang terlalu dingin",
            "Jika gejala memburuk atau berlangsung lebih dari seminggu, segera konsultasikan ke dokter"
        ]
    },
    "Demam Berdarah": {
        "description": "Penyakit yang disebabkan oleh virus dengue yang ditularkan melalui gigitan nyamuk Aedes aegypti. Demam berdarah bisa menyebabkan demam tinggi, nyeri otot dan sendi, serta bisa mengakibatkan penurunan trombosit.",
        "recommendations": [
            "Segera periksakan diri ke dokter atau rumah sakit untuk mendapatkan perawatan",
            "Minum banyak cairan untuk mencegah dehidrasi",
            "Hindari obat-obatan yang mengandung aspirin atau ibuprofen yang dapat meningkatkan risiko perdarahan",
            "Istirahat total dan pantau tanda-tanda penurunan trombosit seperti mimisan atau bintik merah di kulit",
            "Konsumsi makanan bergizi dan mudah dicerna"
        ]
    },
    "Tipes": {
        "description": "Infeksi bakteri Salmonella typhi yang menyerang saluran pencernaan dan dapat menyebar ke seluruh tubuh. Tipes dapat menyebabkan demam tinggi, sakit kepala, sakit perut, dan sembelit atau diare.",
        "recommendations": [
            "Segera periksakan diri ke dokter untuk mendapatkan diagnosis dan pengobatan yang tepat",
            "Istirahat total selama masa pemulihan",
            "Konsumsi makanan lunak dan mudah dicerna",
            "Minum banyak cairan untuk mencegah dehidrasi",
            "Hindari makanan pedas, berlemak, dan bersantan",
            "Patuhi jadwal minum antibiotik sesuai resep dokter hingga tuntas"
        ]
    },
    "TBC": {
        "description": "Infeksi bakteri Mycobacterium tuberculosis yang biasanya menyerang paru-paru. TBC dapat menyebabkan batuk berdahak dan berdarah, nyeri dada, demam, keringat malam, dan penurunan berat badan.",
        "recommendations": [
            "Segera periksakan diri ke dokter atau puskesmas untuk diagnosis dan penanganan",
            "Jalani pengobatan lengkap sesuai petunjuk dokter, biasanya selama 6-9 bulan",
            "Patuhi jadwal minum obat secara teratur dan lengkap",
            "Tutup mulut saat batuk untuk mencegah penularan",
            "Konsumsi makanan bergizi untuk meningkatkan daya tahan tubuh",
            "Ventilasi rumah yang baik dan paparan sinar matahari yang cukup"
        ]
    },
    "Maag": {
        "description": "Gangguan pada lambung yang disebabkan oleh asam lambung yang berlebihan atau iritasi pada dinding lambung. Maag dapat menyebabkan nyeri ulu hati, mual, kembung, dan gangguan pencernaan.",
        "recommendations": [
            "Hindari makanan pedas, asam, berlemak, dan minuman berkafein atau beralkohol",
            "Makan dalam porsi kecil tapi sering",
            "Jangan telat makan atau terlalu lama kosong perut",
            "Hindari stres berlebihan yang dapat memicu kekambuhan",
            "Konsumsi obat antasida sesuai anjuran dokter",
            "Jika gejala berlanjut, periksakan diri ke dokter untuk penanganan lebih lanjut"
        ]
    },
    "Asma": {
        "description": "Penyakit kronis pada saluran pernapasan yang ditandai dengan peradangan dan penyempitan saluran napas. Asma dapat menyebabkan sesak napas, mengi, batuk, dan rasa berat di dada.",
        "recommendations": [
            "Hindari faktor pencetus asma seperti debu, polusi, asap rokok, dan udara dingin",
            "Gunakan inhaler sesuai petunjuk dokter",
            "Selalu bawa inhaler kemanapun pergi",
            "Jika serangan asma parah dan tidak membaik dengan inhaler, segera ke rumah sakit",
            "Konsultasikan dengan dokter untuk membuat rencana penanganan asma jangka panjang",
            "Lakukan olahraga ringan secara teratur untuk meningkatkan fungsi paru-paru"
        ]
    },
    "Migrain": {
        "description": "Gangguan saraf yang ditandai dengan sakit kepala berdenyut di satu sisi kepala. Migrain sering disertai dengan mual, muntah, dan sensitivitas terhadap cahaya dan suara.",
        "recommendations": [
            "Istirahat di ruangan yang tenang dan gelap saat serangan terjadi",
            "Kompres dingin pada bagian kepala yang sakit",
            "Hindari faktor pemicu seperti kurang tidur, stres, atau makanan tertentu",
            "Konsumsi obat pereda nyeri sesuai anjuran dokter",
            "Jika migrain terjadi secara rutin, konsultasikan dengan dokter untuk pengobatan pencegahan",
            "Kelola stres dengan teknik relaksasi seperti meditasi atau yoga"
        ]
    },
    "Diare": {
        "description": "Kondisi saat feses menjadi encer dan frekuensi buang air besar meningkat. Diare biasanya disebabkan oleh infeksi virus, bakteri, atau parasit, serta bisa juga karena keracunan makanan atau intoleransi makanan.",
        "recommendations": [
            "Minum banyak cairan untuk mencegah dehidrasi, seperti air putih, oralit, atau sup",
            "Konsumsi makanan lunak seperti bubur, pisang, roti, dan hindari makanan pedas, berlemak, atau berserat tinggi",
            "Hindari produk susu, kafein, dan makanan pedas sementara waktu",
            "Cuci tangan secara teratur untuk mencegah penularan",
            "Jika diare berlangsung lebih dari 2 hari atau disertai demam tinggi dan darah dalam tinja, segera periksakan ke dokter"
        ]
    },
    "Hipertensi": {
        "description": "Kondisi tekanan darah yang terus-menerus tinggi pada dinding arteri. Hipertensi meningkatkan risiko penyakit jantung, stroke, dan masalah kesehatan lainnya.",
        "recommendations": [
            "Batasi konsumsi garam (sodium) dalam makanan",
            "Konsumsi makanan kaya buah, sayuran, dan produk susu rendah lemak",
            "Lakukan aktivitas fisik secara teratur, minimal 30 menit per hari",
            "Batasi konsumsi alkohol dan berhenti merokok",
            "Pantau tekanan darah secara teratur",
            "Konsumsi obat darah tinggi sesuai resep dokter secara teratur",
            "Kelola stres dengan teknik relaksasi"
        ]
    },
    "Diabetes": {
        "description": "Penyakit kronis yang ditandai dengan kadar gula darah tinggi karena tubuh tidak dapat memproduksi atau menggunakan insulin dengan baik. Diabetes dapat menyebabkan kerusakan pada berbagai organ tubuh jika tidak ditangani dengan baik.",
        "recommendations": [
            "Pantau kadar gula darah secara teratur",
            "Ikuti pola makan seimbang dengan membatasi karbohidrat sederhana dan gula",
            "Lakukan aktivitas fisik secara teratur",
            "Konsumsi obat diabetes atau insulin sesuai resep dokter",
            "Jaga berat badan ideal",
            "Rawat kaki dengan baik dan perhatikan luka yang lambat sembuh",
            "Periksakan diri ke dokter secara rutin untuk mencegah komplikasi"
        ]
    },
    "Tidak diketahui": {
        "description": "Sulit menentukan diagnosis yang tepat berdasarkan gejala yang disampaikan.",
        "recommendations": [
            "Periksakan diri ke dokter untuk evaluasi lebih lanjut",
            "Berikan informasi gejala secara lebih detail kepada tenaga medis",
            "Lakukan pemeriksaan fisik dan tes laboratorium jika diperlukan",
            "Istirahat yang cukup dan minum banyak air putih",
            "Pantau perkembangan gejala dan catat jika ada perubahan"
        ]
    },
    "Eksim": {
        "description": "Kondisi peradangan pada kulit yang menyebabkan kulit menjadi gatal, merah, kering, dan bersisik. Eksim atau dermatitis atopik sering terjadi pada orang dengan riwayat alergi atau asma.",
        "recommendations": [
            "Hindari bahan-bahan yang dapat memicu iritasi seperti sabun keras dan deterjen",
            "Gunakan pelembab secara teratur untuk menjaga kelembaban kulit",
            "Hindari menggaruk area yang gatal karena dapat memperburuk kondisi",
            "Konsultasikan dengan dokter untuk mendapatkan krim atau salep yang sesuai",
            "Mandi dengan air hangat, jangan terlalu panas, dan gunakan sabun lembut",
            "Jaga suhu ruangan tetap sejuk dan hindari keringat berlebih"
        ]
    },
    "Infeksi Saluran Kemih": {
        "description": "Infeksi yang terjadi pada saluran kemih, termasuk kandung kemih, uretra, ureter, dan ginjal. Biasanya disebabkan oleh bakteri dan lebih sering terjadi pada wanita.",
        "recommendations": [
            "Minum banyak air putih untuk membantu mengeluarkan bakteri dari saluran kemih",
            "Konsultasikan dengan dokter untuk mendapatkan antibiotik yang sesuai",
            "Jangan menahan buang air kecil terlalu lama",
            "Bersihkan area kemaluan dari depan ke belakang (terutama untuk wanita)",
            "Buang air kecil setelah berhubungan seksual",
            "Hindari produk-produk yang dapat mengiritasi area kemaluan seperti sabun beraroma"
        ]
    },
    "Radang Sendi": {
        "description": "Peradangan pada persendian yang menyebabkan nyeri, kekakuan, dan pembengkakan. Bisa disebabkan oleh berbagai faktor termasuk usia, cedera, atau penyakit autoimun seperti artritis reumatoid.",
        "recommendations": [
            "Istirahatkan sendi yang terasa nyeri dan hindari aktivitas yang memberatkan",
            "Kompres dingin atau hangat dapat membantu mengurangi rasa sakit dan pembengkakan",
            "Gunakan obat pereda nyeri seperti paracetamol sesuai petunjuk",
            "Konsultasikan dengan dokter untuk diagnosis dan pengobatan yang tepat",
            "Pertahankan berat badan ideal untuk mengurangi tekanan pada sendi",
            "Lakukan olahraga ringan seperti berenang atau berjalan untuk menjaga fleksibilitas sendi"
        ]
    }
}