{
    "Flu": {
        "description": "Infeksi virus yang menyerang hidung, tenggorokan, dan paru-paru. Flu mudah menular dan bisa menyebabkan demam, sakit tenggorokan, batuk, pilek, dan nyeri otot.",
        "recommendations": [
            "Istirahat yang cukup untuk memulihkan kondisi tubuh",
            "Minum air putih yang banyak untuk mencegah dehidrasi",
            "Konsumsi obat penurun demam seperti paracetamol jika diperlukan",
            "Hindari makanan atau minuman yang terlalu dingin",
            "Jika gejala memburuk atau berlangsung lebih dari seminggu, segera konsultasikan ke dokter"
        ]
    },
    "Demam Berdarah": {
        "description": "Penyakit yang disebabkan oleh virus dengue yang ditularkan melalui gigitan nyamuk Aedes aegypti. Demam berdarah bisa menyebabkan demam tinggi, nyeri otot dan sendi, serta bisa mengakibatkan penurunan trombosit.",
        "recommendations": [
            "Segera periksakan diri ke dokter atau rumah sakit untuk mendapatkan perawatan",
            "Minum banyak cairan untuk mencegah dehidrasi",
            "Hindari obat-obatan yang mengandung aspirin atau ibuprofen yang dapat meningkatkan risiko perdarahan",
            "Istirahat total dan pantau tanda-tanda penurunan trombosit seperti mimisan atau bintik merah di kulit",
            "Konsumsi makanan bergizi dan mudah dicerna"
        ]
    },
    "Tipes": {
        "description": "Infeksi bakteri Salmonella typhi yang menyerang saluran pencernaan dan dapat menyebar ke seluruh tubuh. Tipes dapat menyebabkan demam tinggi, sakit kepala, sakit perut, dan sembelit atau diare.",
        "recommendations": [
            "Segera periksakan diri ke dokter untuk mendapatkan diagnosis dan pengobatan yang tepat",
            "Istirahat total selama masa pemulihan",
            "Konsumsi makanan lunak dan mudah dicerna",
            "Minum banyak cairan untuk mencegah dehidrasi",
            "Hindari makanan pedas, berlemak, dan bersantan",
            "Patuhi jadwal minum antibiotik sesuai resep dokter hingga tuntas"
        ]
    },
    "TBC": {
        "description": "Infeksi bakteri Mycobacterium tuberculosis yang biasanya menyerang paru-paru. TBC dapat menyebabkan batuk berdahak dan berdarah, nyeri dada, demam, keringat malam, dan penurunan berat badan.",
        "recommendations": [
            "Segera periksakan diri ke dokter atau puskesmas untuk diagnosis dan penanganan",
            "Jalani pengobatan lengkap sesuai petunjuk dokter, biasanya selama 6-9 bulan",
            "Patuhi jadwal minum obat secara teratur dan lengkap",
            "Tutup mulut saat batuk untuk mencegah penularan",
            "Konsumsi makanan bergizi untuk meningkatkan daya tahan tubuh",
            "Ventilasi rumah yang baik dan paparan sinar matahari yang cukup"
        ]
    },
    "Maag": {
        "description": "Gangguan pada lambung yang disebabkan oleh asam lambung yang berlebihan atau iritasi pada dinding lambung. Maag dapat menyebabkan nyeri ulu hati, mual, kembung, dan gangguan pencernaan.",
        "recommendations": [
            "Hindari makanan pedas, asam, berlemak, dan minuman berkafein atau beralkohol",
            "Makan dalam porsi kecil tapi sering",
            "Jangan telat makan atau terlalu lama kosong perut",
            "Hindari stres berlebihan yang dapat memicu kekambuhan",
            "Konsumsi obat antasida sesuai anjuran dokter",
            "Jika gejala berlanjut, periksakan diri ke dokter untuk penanganan lebih lanjut"
        ]
    },
    "Asma": {
        "description": "Penyakit kronis pada saluran pernapasan yang ditandai dengan peradangan dan penyempitan saluran napas. Asma dapat menyebabkan sesak napas, mengi, batuk, dan rasa berat di dada.",
        "recommendations": [
            "Hindari faktor pencetus asma seperti debu, polusi, asap rokok, dan udara dingin",
            "Gunakan inhaler sesuai petunjuk dokter",
            "Selalu bawa inhaler kemanapun pergi",
            "Jika serangan asma parah dan tidak membaik dengan inhaler, segera ke rumah sakit",
            "Konsultasikan dengan dokter untuk membuat rencana penanganan asma jangka panjang",
            "Lakukan olahraga ringan secara teratur untuk meningkatkan fungsi paru-paru"
        ]
    },
    "Migrain": {
        "description": "Gangguan saraf yang ditandai dengan sakit kepala berdenyut di satu sisi kepala. Migrain sering disertai dengan mual, muntah, dan sensitivitas terhadap cahaya dan suara.",
        "recommendations": [
            "Istirahat di ruangan yang tenang dan gelap saat serangan terjadi",
            "Kompres dingin pada bagian kepala yang sakit",
            "Hindari faktor pemicu seperti kurang tidur, stres, atau makanan tertentu",
            "Konsumsi obat pereda nyeri sesuai anjuran dokter",
            "Jika migrain terjadi secara rutin, konsultasikan dengan dokter untuk pengobatan pencegahan",
            "Kelola stres dengan teknik relaksasi seperti meditasi atau yoga"
        ]
    },
    "Diare": {
        "description": "Kondisi saat feses menjadi encer dan frekuensi buang air besar meningkat. Diare biasanya disebabkan oleh infeksi virus, bakteri, atau parasit, serta bisa juga karena keracunan makanan atau intoleransi makanan.",
        "recommendations": [
            "Minum banyak cairan untuk mencegah dehidrasi, seperti air putih, oralit, atau sup",
            "Konsumsi makanan lunak seperti bubur, pisang, roti, dan hindari makanan pedas, berlemak, atau berserat tinggi",
            "Hindari produk susu, kafein, dan makanan pedas sementara waktu",
            "Cuci tangan secara teratur untuk mencegah penularan",
            "Jika diare berlangsung lebih dari 2 hari atau disertai demam tinggi dan darah dalam tinja, segera periksakan ke dokter"
        ]
    },
    "Hipertensi": {
        "description": "Kondisi tekanan darah yang terus-menerus tinggi pada dinding arteri. Hipertensi meningkatkan risiko penyakit jantung, stroke, dan masalah kesehatan lainnya.",
        "recommendations": [
            "Batasi konsumsi garam (sodium) dalam makanan",
            "Konsumsi makanan kaya buah, sayuran, dan produk susu rendah lemak",
            "Lakukan aktivitas fisik secara teratur, minimal 30 menit per hari",
            "Batasi konsumsi alkohol dan berhenti merokok",
            "Pantau tekanan darah secara teratur",
            "Konsumsi obat darah tinggi sesuai resep dokter secara teratur",
            "Kelola stres dengan teknik relaksasi"
        ]
    },
    "Diabetes": {
        "description": "Kondisi yang ditandai dengan kadar gula darah tinggi karena tubuh tidak dapat memproduksi atau menggunakan insulin dengan baik. Diabetes dapat menyebabkan berbagai komplikasi jika tidak ditangani dengan baik.",
        "recommendations": [
            "Pantau kadar gula darah secara teratur",
            "Ikuti diet seimbang dengan batasan gula dan karbohidrat sesuai anjuran",
            "Lakukan aktivitas fisik secara rutin",
            "Konsumsi obat atau insulin sesuai resep dokter",
            "Periksa kaki setiap hari untuk mencegah luka yang sulit sembuh",
            "Kontrol berat badan dalam rentang sehat",
            "Periksakan diri ke dokter secara rutin untuk mencegah komplikasi"
        ]
    },
    "Eksim": {
        "description": "Kondisi peradangan pada kulit yang ditandai dengan kulit kering, gatal, kemerahan, dan kadang-kadang lepuh. Eksim dapat dipicu oleh faktor genetik, alergi, atau lingkungan.",
        "recommendations": [
            "Hindari bahan-bahan yang dapat memicu alergi seperti sabun keras dan deterjen",
            "Gunakan pelembab secara teratur untuk mengatasi kulit kering",
            "Hindari menggaruk area yang gatal untuk mencegah infeksi",
            "Gunakan pakaian berbahan lembut seperti katun",
            "Mandi dengan air hangat (tidak panas) dan segera gunakan pelembab setelah mandi",
            "Konsultasikan dengan dokter kulit untuk pengobatan yang tepat jika kondisi memburuk"
        ]
    },
    "Infeksi Saluran Kemih": {
        "description": "Infeksi yang terjadi di saluran kemih termasuk kandung kemih, uretra, ureter, dan ginjal. ISK lebih sering terjadi pada wanita dan ditandai dengan rasa terbakar saat buang air kecil dan keinginan buang air kecil yang sering.",
        "recommendations": [
            "Minum banyak air putih untuk membantu membilas bakteri dari saluran kemih",
            "Buang air kecil segera saat terasa ingin, jangan ditahan",
            "Jaga kebersihan area genital",
            "Konsumsi obat antibiotik sesuai resep dokter hingga habis meskipun gejala sudah hilang",
            "Hindari minuman yang dapat mengiritasi kandung kemih seperti alkohol, kafein, dan minuman bersoda",
            "Konsultasikan dengan dokter jika gejala tidak membaik setelah beberapa hari pengobatan"
        ]
    },
    "Radang Sendi": {
        "description": "Peradangan pada satu atau lebih sendi yang menyebabkan nyeri dan kekakuan. Terdapat berbagai jenis radang sendi, dengan osteoartritis dan rheumatoid arthritis sebagai jenis yang paling umum.",
        "recommendations": [
            "Lakukan latihan ringan dan peregangan untuk menjaga fleksibilitas sendi",
            "Jaga berat badan ideal untuk mengurangi tekanan pada sendi",
            "Gunakan kompres panas atau dingin untuk meredakan nyeri",
            "Konsumsi obat anti-inflamasi sesuai anjuran dokter",
            "Istirahatkan sendi yang sakit, tetapi hindari imobilisasi yang terlalu lama",
            "Gunakan alat bantu seperti tongkat atau penyangga jika diperlukan",
            "Konsultasikan dengan dokter untuk program terapi yang sesuai"
        ]
    },
    "Alergi Makanan": {
        "description": "Respons imun abnormal terhadap protein dalam makanan tertentu. Alergi makanan dapat menyebabkan gejala ringan seperti gatal-gatal hingga yang lebih serius seperti anafilaksis.",
        "recommendations": [
            "Hindari makanan yang menyebabkan alergi",
            "Baca label makanan dengan cermat untuk mengidentifikasi alergen tersembunyi",
            "Informasikan kondisi alergi Anda kepada restoran saat makan di luar",
            "Bawalah selalu obat alergi atau EpiPen jika Anda memiliki riwayat reaksi parah",
            "Kenakan gelang informasi medis jika alergi Anda parah",
            "Konsultasikan dengan ahli alergi untuk tes dan manajemen alergi yang tepat"
        ]
    },
    "Sinusitis": {
        "description": "Peradangan pada rongga sinus yang biasanya disebabkan oleh infeksi virus, bakteri, atau jamur. Sinusitis ditandai dengan hidung tersumbat, sakit kepala, nyeri wajah, dan lendir kental.",
        "recommendations": [
            "Gunakan semprotan hidung saline untuk membantu mengencerkan dan mengalirkan lendir",
            "Hirup uap hangat untuk membantu mengurangi sumbatan",
            "Hindari iritan seperti asap rokok dan polusi",
            "Kompres hangat pada wajah untuk meredakan nyeri",
            "Minum banyak cairan untuk mengencerkan lendir",
            "Jika gejala berlangsung lebih dari 10 hari atau sangat parah, konsultasikan dengan dokter"
        ]
    },
    "Campak": {
        "description": "Penyakit menular akibat infeksi virus yang ditandai dengan demam tinggi, batuk, pilek, mata merah, dan ruam merah di kulit.",
        "recommendations": [
            "Istirahat total dan minum banyak cairan",
            "Kompres hangat untuk menurunkan demam",
            "Hindari kontak dengan orang lain untuk mencegah penularan",
            "Gunakan obat penurun panas jika diperlukan",
            "Segera ke dokter jika muncul sesak napas atau kejang"
        ]
    },
    "Cacar Air": {
        "description": "Infeksi virus varicella-zoster yang menyebabkan ruam berisi cairan dan sangat gatal di seluruh tubuh.",
        "recommendations": [
            "Jaga kebersihan kulit dan hindari menggaruk ruam",
            "Gunakan losion calamine untuk mengurangi gatal",
            "Istirahat cukup dan minum banyak cairan",
            "Gunakan obat penurun demam jika diperlukan",
            "Segera ke dokter jika ruam terinfeksi atau demam tinggi"
        ]
    },
    "Hepatitis A": {
        "description": "Infeksi hati akibat virus hepatitis A yang ditandai dengan mual, muntah, demam, kulit dan mata menguning, serta urine gelap.",
        "recommendations": [
            "Istirahat total dan konsumsi makanan bergizi",
            "Minum banyak cairan untuk mencegah dehidrasi",
            "Hindari makanan berlemak dan alkohol",
            "Cuci tangan sebelum makan dan setelah dari toilet",
            "Segera ke dokter jika gejala memburuk"
        ]
    },
    "Anemia": {
        "description": "Kondisi kekurangan sel darah merah atau hemoglobin yang menyebabkan lemas, pucat, dan mudah lelah.",
        "recommendations": [
            "Konsumsi makanan kaya zat besi seperti daging merah, hati, dan sayuran hijau",
            "Minum suplemen zat besi jika diresepkan dokter",
            "Istirahat cukup dan hindari aktivitas berat",
            "Segera ke dokter jika sering pingsan atau sesak napas berat"
        ]
    },
    "Vertigo": {
        "description": "Gangguan keseimbangan yang menyebabkan sensasi berputar, mual, muntah, dan sulit berdiri.",
        "recommendations": [
            "Duduk atau berbaring segera saat vertigo menyerang",
            "Hindari gerakan kepala mendadak",
            "Minum obat anti-mual jika diresepkan dokter",
            "Konsultasikan ke dokter jika vertigo sering kambuh"
        ]
    },
    "Bronkitis": {
        "description": "Peradangan pada saluran bronkus paru-paru yang menyebabkan batuk berdahak, sesak napas, dan demam ringan.",
        "recommendations": [
            "Istirahat cukup dan minum air hangat",
            "Hindari asap rokok dan polusi",
            "Gunakan obat batuk sesuai anjuran dokter",
            "Segera ke dokter jika batuk berdarah atau sesak berat"
        ]
    },
    "Pneumonia": {
        "description": "Infeksi paru-paru yang menyebabkan demam tinggi, batuk berdahak, sesak napas, dan nyeri dada.",
        "recommendations": [
            "Segera periksakan diri ke dokter untuk pengobatan antibiotik",
            "Istirahat total dan minum banyak cairan",
            "Gunakan obat penurun demam jika diperlukan",
            "Pantau pernapasan dan segera ke IGD jika sesak berat"
        ]
    },
    "Demam Scarlet": {
        "description": "Infeksi bakteri Streptococcus yang menyebabkan demam, ruam merah, sakit tenggorokan, dan lidah merah.",
        "recommendations": [
            "Segera ke dokter untuk mendapatkan antibiotik",
            "Istirahat cukup dan minum banyak cairan",
            "Konsumsi makanan lunak jika tenggorokan sakit",
            "Pantau ruam dan suhu tubuh"
        ]
    },
    "COVID-19": {
        "description": "Penyakit infeksi saluran pernapasan akibat virus corona, gejala utama: demam, batuk, sesak napas, hilang penciuman.",
        "recommendations": [
            "Lakukan isolasi mandiri minimal 5 hari",
            "Gunakan masker dan jaga jarak dengan orang lain",
            "Minum banyak cairan dan istirahat cukup",
            "Segera ke dokter jika sesak napas berat atau saturasi oksigen turun",
            "Pantau suhu tubuh dan gejala lain secara berkala"
        ]
    },
    "Tidak diketahui": {
        "description": "Berdasarkan gejala yang diberikan, tidak dapat dipastikan diagnosis yang tepat. Ini bisa disebabkan oleh berbagai faktor seperti gejala yang tidak spesifik, atau kondisi yang jarang terjadi.",
        "recommendations": [
            "Konsultasikan dengan dokter untuk pemeriksaan lebih lanjut dan diagnosis yang tepat",
            "Catat semua gejala yang dialami secara detail, termasuk kapan mulai terjadi dan apa yang memperburuk atau meringankan gejala",
            "Hindari mendiagnosis sendiri dan mengobati diri tanpa petunjuk medis",
            "Prioritaskan istirahat dan jaga kesehatan secara umum sambil menunggu konsultasi medis",
            "Jika gejala semakin parah, segera cari bantuan medis darurat"
        ]
    }
}